In [1]:
from pandas import DataFrame,Series
import pandas as pd

## pandas 数据结构介绍
### Series
类似一维数组，由数据和索引组成，索引可省略

In [7]:
# 省略索引，自动生成
obj = Series(['Allen','Bill','Didi','Cash'])
obj

0    Allen
1     Bill
2     Didi
3     Cash
dtype: object

In [9]:
obj2 = Series(['Allen','Bill','Didi','Cash'],index=['A','B','D','C'])
obj2

A    Allen
B     Bill
D     Didi
C     Cash
dtype: object

In [12]:
obj2['A']

'Allen'

In [14]:
# 索引可以是一个值对象，也可以是一个列表对象，反正只能是一个对象
obj2[['A','B']]

A    Allen
B     Bill
dtype: object

In [15]:
# 可以视为一个字典——索引到数据的映射
'A' in obj2

True

In [17]:
# 因此可以通过一个字典创建一个Series对象
# 索引是乱序的
data={'id':'yikayiyo','sex':'♂','age':'Ha?'}
obj3 = Series(data)
obj3

age         Ha?
id     yikayiyo
sex           ♂
dtype: object

In [18]:
# 指定索引，找不对应数据的NaN填充
data={'id':'yikayiyo','sex':'♂','age':'Ha?'}
obj4 = Series(data,index=['id','age','sex','tel'])
obj4

id     yikayiyo
age         Ha?
sex           ♂
tel         NaN
dtype: object

In [19]:
# 作用相反的两个函数
# obj4.notnull()
obj4.isnull()

id     False
age    False
sex    False
tel     True
dtype: bool

In [21]:
obj3+obj4

age              Ha?Ha?
id     yikayiyoyikayiyo
sex                  ♂♂
tel                 NaN
dtype: object

In [22]:
obj4.name = 'infos'
obj4.index.name='info'
obj4

info
id     yikayiyo
age         Ha?
sex           ♂
tel         NaN
Name: infos, dtype: object

In [ ]:
#索引可以赋值修改
obj.index=['AA','BB','DD','CC']
obj

### DataFrame 
表格型的数据结构

In [26]:
data={'name':['A','B','C'],'age':[29,27,18],'sex':['male','female','male']}
frame=DataFrame(data)
frame

   age name     sex
0   29    A    male
1   27    B  female
2   18    C    male

In [33]:
# columns 指定列顺序
frame = DataFrame(data,columns=['name','age','sex'])
frame

  name  age     sex
0    A   29    male
1    B   27  female
2    C   18    male

In [37]:
# 多出的columns 会补NaN ，index多出或者不够都会报错
frame2 = DataFrame(data,columns=['name','age','sex','tel'],index=['one','two','three'])
frame2

      name  age     sex  tel
one      A   29    male  NaN
two      B   27  female  NaN
three    C   18    male  NaN

In [39]:
frame2.sex

one        male
two      female
three      male
Name: sex, dtype: object

In [40]:
# 另一种写法
frame2['sex']

one        male
two      female
three      male
Name: sex, dtype: object

In [43]:
# 根据索引返回某行
# ix 不推荐使用了
frame2.loc['one']

name       A
age       29
sex     male
tel      NaN
Name: one, dtype: object

In [53]:
# 为某列NaN赋值
val=Series({'one':'0001','two':'0002','three':'0003'})
# 别的写法
# val=Series(data=['001','002','003'],index=['one','two','three'])
frame2.tel = val
frame2

      name  age     sex   tel
one      A   29    male  0001
two      B   27  female  0002
three    C   18    male  0003

In [66]:
frame2['address']=frame2.sex=='male'
#无效的写法frame2.address=Series(data=['ss','s','sss'],index=['one','two','three'])
frame2

      name  age     sex   tel  address
one      A   29    male  0001     True
two      B   27  female  0002    False
three    C   18    male  0003     True

In [67]:
# 无效
del frame2.address

In [68]:
frame2

      name  age     sex   tel  address
one      A   29    male  0001     True
two      B   27  female  0002    False
three    C   18    male  0003     True

In [69]:
del frame2['address']

In [70]:
frame2

      name  age     sex   tel
one      A   29    male  0001
two      B   27  female  0002
three    C   18    male  0003